import { createStore } from 'vuex'

const store = createStore({
    state() {
        return {
            listData: [{
                id: 1 ,
                title: 'Володар Перснів',
                description: 'Історія відбувається в контексті історичних подій північно-західного Середземя. Задовго до початку роману, в 1600 році Другої епохи, Темний Володар Саурон викував Єдиний Перстень, щоб здобути владу над іншими перснями, які перебувають в руках вождів людей, ельфів та гномів.',
                author: 'Джон Рональд Руел Толкін',
                img: 'https://s1.livelib.ru/boocover/1000391178/o/b9ad/Dzh._R._R._Tolkin__Vlastelin_Kolets._Kniga_1._Hraniteli_Koltsa.jpeg'
            },
            {
                id: 2,
                title: 'Володар Перснів',
                description: 'Історія відбувається в контексті історичних подій північно-західного Середземя. Задовго до початку роману, в 1600 році Другої епохи, Темний Володар Саурон викував Єдиний Перстень, щоб здобути владу над іншими перснями, які перебувають в руках вождів людей, ельфів та гномів.',
                author: 'Джон Рональд Руел Толкін',
                img: 'https://s1.livelib.ru/boocover/1000391178/o/b9ad/Dzh._R._R._Tolkin__Vlastelin_Kolets._Kniga_1._Hraniteli_Koltsa.jpeg'
            },
            {
                id: 3,
                title: 'Володар Перснів',
                description: 'Історія відбувається в контексті історичних подій північно-західного Середземя. Задовго до початку роману, в 1600 році Другої епохи, Темний Володар Саурон викував Єдиний Перстень, щоб здобути владу над іншими перснями, які перебувають в руках вождів людей, ельфів та гномів.',
                author: 'Джон Рональд Руел Толкін',
                img: 'https://s1.livelib.ru/boocover/1000391178/o/b9ad/Dzh._R._R._Tolkin__Vlastelin_Kolets._Kniga_1._Hraniteli_Koltsa.jpeg'
            },
            {
                id: 4,
                title: 'Володар Перснів',
                description: 'Історія відбувається в контексті історичних подій північно-західного Середземя. Задовго до початку роману, в 1600 році Другої епохи, Темний Володар Саурон викував Єдиний Перстень, щоб здобути владу над іншими перснями, які перебувають в руках вождів людей, ельфів та гномів.',
                author: 'Джон Рональд Руел Толкін',
                img: 'https://s1.livelib.ru/boocover/1000391178/o/b9ad/Dzh._R._R._Tolkin__Vlastelin_Kolets._Kniga_1._Hraniteli_Koltsa.jpeg'
            },
            {
                id: 5,
                title: 'Володар Перснів',
                description: 'Історія відбувається в контексті історичних подій північно-західного Середземя. Задовго до початку роману, в 1600 році Другої епохи, Темний Володар Саурон викував Єдиний Перстень, щоб здобути владу над іншими перснями, які перебувають в руках вождів людей, ельфів та гномів.',
                author: 'Джон Рональд Руел Толкін',
                img: 'https://s1.livelib.ru/boocover/1000391178/o/b9ad/Dzh._R._R._Tolkin__Vlastelin_Kolets._Kniga_1._Hraniteli_Koltsa.jpeg'
            },
            {
                id: 6,
                title: 'Володар Перснів',
                description: 'Історія відбувається в контексті історичних подій північно-західного Середземя. Задовго до початку роману, в 1600 році Другої епохи, Темний Володар Саурон викував Єдиний Перстень, щоб здобути владу над іншими перснями, які перебувають в руках вождів людей, ельфів та гномів.',
                author: 'Джон Рональд Руел Толкін',
                img: 'https://s1.livelib.ru/boocover/1000391178/o/b9ad/Dzh._R._R._Tolkin__Vlastelin_Kolets._Kniga_1._Hraniteli_Koltsa.jpeg'
            },
        ],
        }
    },
    getters: {
        getBookList: (state) => state.listData,
        getBookById: (state) => (id) =>
          id ? state.listData.find((item) => item.id == id) : {},
    },

    mutations: {

    },

    actions: {

    }
})

export default store